# Based on:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://danielmiessler.com/blog/first-10-things-new-mac/
# https://hackercodex.com/guide/python-development-environment-on-mac-osx/
# See homebrew-bundle:
# https://github.com/Homebrew/homebrew-bundle

# Command-Line Mac App Store
# 'brew install mas && mas signin <email>'
mas 'Slack', id: 803453959
mas 'Simplenote', id: 692867256
mas 'Stay', id: 435410196
mas 'flycut-clipboard-manager', id: 442160987
mas 'soulver-2', id: 413965349
mas 'spark-email-app-by-readdle', id: 1176895641
mas 'things-3', id: 904280696

# Cask macOS apps
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'paw'
cask 'contexts'
cask 'dash'
cask 'insomnia'
cask 'ballast'
cask 'raycast'

# Shells
brew 'zsh'

# Fonts
tap 'homebrew/cask-fonts'
brew 'brew-cask-completion'
cask 'font-source-code-pro'
cask 'font-sauce-code-pro-nerd-font'

# Dev
brew 'kitty'
brew 'git'
brew 'jq'
brew 'tree'
brew 'watch'
brew 'sops'
cask 'mysql-shell'
brew 'httpie'
brew 'gh'
brew 'pwgen'
cask 'linear-linear'
cask 'front'
cask 'discord'
brew 'zoxide'
tap 'tilt-dev/tap'
brew 'tilt-dev/tap/tilt'
brew 'tilt-dev/tap/ctlptl'
brew 'java'
brew 'kind'
brew 'kubectx'
brew 'watchman'
brew 'libpq'
brew 'tfenv'
brew 'grpcurl'
brew 'firebase-cli'
cask 'dbeaver-community'
brew 'postman'

# Mobile Dev
brew 'cocoapods'

# Design
cask 'figma'

# NodeJS
brew 'yarn'
brew 'nvm'

# Stripe
brew 'stripe/stripe-cli/stripe'

# Dev/Cloud
cask 'google-cloud-sdk'
brew 'google-backup-and-sync'

# Dev/Apps
cask 'sublime-text'
tap 'heroku/brew'
brew 'heroku'

# Keyboard
cask 'karabiner-elements'

# Neovim
brew 'neovim'
brew 'fzf'
brew 'ripgrep'
brew 'bat'

# Window Management
cask 'spectacle'

# Dev/Containers
brew 'kubectl'
brew 'kubernetes-helm'
# brew 'docker'
# brew 'docker-compose'
# brew 'docker-machine'

# Dev/Python
# a) virtualenv way:
# PIP_REQUIRE_VIRTUALENV="false" pip install virtualenv
# PIP_REQUIRE_VIRTUALENV="false" pip3 install virtualenv
# virtualenv -p python <name> # or:
# virtualenv -p python3 <name>
# b) pyenv way:
# pyenv install <python version>
# pyenv virtualenv <python version> <name>
# brew 'python' # 3
brew 'pyenv'
# brew 'pyenv-virtualenv'

# Misc
