# Based on:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://danielmiessler.com/blog/first-10-things-new-mac/
# https://hackercodex.com/guide/python-development-environment-on-mac-osx/
# See homebrew-bundle:
# https://github.com/Homebrew/homebrew-bundle

# Command-Line Mac App Store
# 'brew install mas && mas signin <email>'
mas 'Slack', id: 803453959
mas 'Simplenote', id: 692867256
mas 'flycut-clipboard-manager', id: 442160987
mas 'soulver-2', id: 413965349

# Cask macOS apps
cask 'google-chrome'
cask 'firefox'
cask 'paw'
# Audio Sound Balance Fixer
cask 'ballast'
# App Switchers
cask 'contexts'
cask 'raycast'
# Email
cask 'mimestream'

# Monitors
cask 'monitorcontrol'

# Shells
brew 'zsh'

# Fonts
tap 'homebrew/cask-fonts'
brew 'brew-cask-completion'
cask 'font-source-code-pro'
cask 'font-sauce-code-pro-nerd-font'

# Dev
brew 'kitty'
brew 'git'
brew 'jq'
brew 'tree'
brew 'watch'
brew 'sops'
cask 'mysql-shell'
brew 'httpie'
brew 'gh'
brew 'pwgen'
cask 'linear-linear'
brew 'kind'
brew 'kubectx'
brew 'tfenv'
brew 'grpcurl'
brew 'tableplus'
cask 'gitkraken'

# Encryption
brew 'gnupg'

# Mobile Dev
brew 'cocoapods'

# Design
cask 'figma'

# NodeJS
brew 'yarn'
brew 'pnpm'
brew 'nvm'

# Java
brew 'java'

# Kotlin
brew 'kotlin'
brew 'gradle'

# Stripe
brew 'stripe/stripe-cli/stripe'

# Dev/Cloud
cask 'google-cloud-sdk'
brew 'google-backup-and-sync'

# Dev/Apps
cask 'sublime-text'
tap 'heroku/brew'
brew 'heroku'

# Keyboard
cask 'karabiner-elements'

# Neovim
brew 'neovim'
brew 'fzf'
brew 'ripgrep'
brew 'bat'
brew 'fd'
brew 'delta'

# Window Management
cask 'spectacle'

# Dev/Containers
brew 'kubectl'
brew 'kubernetes-helm'
brew 'pyenv'
